Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Migrating existing Java applications, like Spring Boot ones, to Quarkus by using the Migration Toolkit for Applications
ja_jp: Migration Toolkit for Applicationsを使用した、Spring Bootなどの既存のJavaアプリケーションのQuarkusへの移行

source: Migrating existing applications to Quarkus with Migration Toolkit for Applications
ja_jp: Migration Toolkit for Applicationsを使用した、既存アプリケーションのQuarkusへの移行

source: Migrating from Apicurio Registry 2.x to 3.x
ja_jp: Apicurio Registry 2.x から 3.x への移行

source: Migrating from Docker
ja_jp: Dockerからの移行

source: Migrating from RESTEasy Classic to Quarkus REST (formerly RESTEasy Reactive) is straightforward in most cases, however there are a few cases that require some attention.
ja_jp: RESTEasy ClassicからQuarkus REST（旧RESTEasy Reactive）への移行は、ほとんどの場合簡単ですが、いくつか注意が必要なケースがあります。

source: Migrating from RESTEasy Classic to Quarkus REST (formerly RESTEasy Reactive) is straightforward in most cases, however there are a few cases that require some attention. This document provides a list of issues users attempting the migration should be aware of.
ja_jp: RESTEasy Classicから Quarkus REST (旧: RESTEasy Reactive) への移行は、ほとんどの場合簡単ですが、いくつかの注意が必要なケースがあります。 この文書では、移行を試みるユーザが注意すべき問題のリストを提供します。

source: Migrating from RESTEasy Classic to RESTEasy Reactive
ja_jp: RESTEasy ClassicからRESTEasy Reactiveへの移行について

source: Migrating from RESTEasy Classic to RESTEasy Reactive is straightforward in most cases, however there are a few cases that require some attention.
ja_jp: RESTEasy ClassicからRESTEasy Reactiveへの移行は、ほとんどの場合簡単ですが、いくつかの注意が必要なケースがあります。

source: Migrating from RESTEasy Classic to RESTEasy Reactive is straightforward in most cases, however there are a few cases that require some attention. This document provides a list of issues users attempting the migration should be aware of.
ja_jp: RESTEasy ClassicからRESTEasy Reactiveへの移行は、ほとんどの場合簡単ですが、いくつかの注意が必要なケースがあります。この文書では、移行を試みるユーザが注意すべき問題のリストを提供します。

source: Migrating to 3.0 is super easy
ja_jp: 3.0への移行は超簡単

source: Migrating to Quarkus REST (formerly RESTEasy Reactive)
ja_jp: Quarkus REST（旧RESTEasy Reactive）への移行

source: Migrating to RESTEasy Reactive
ja_jp: RESTEasy Reactiveへの移行

source: Migration Guide
ja_jp: 移行ガイド

source: Migration Paths for Topics with Existing v2 Messages
ja_jp: 既存の v2 メッセージを含むトピックの移行パス

source: Migration Scenarios
ja_jp: 移行シナリオ

source: Migration checklist
ja_jp: 移行チェックリスト

source: Migration guide
ja_jp: マイグレーションガイド

source: Mind you that at this stage, while all the core extensions are available, only parts of the Quarkus platform is present. Not all extensions have yet migrated to Jakarta packages.
ja_jp: 現段階では、コアとなるエクステンションはすべて利用可能ですが、Quarkusプラットフォームの一部しか存在しないことに注意してください。まだすべてのエクステンションがJakartaパッケージに移行しているわけではありません。

source: Mind you, the tools are not better than your own understanding of what they measure thus even when using `wrk2` or `hyperfoil` make sure you understand what the numbers mean.
ja_jp: したがって、 `wrk2` や `hyperfoil` を使う場合でも、その数値が何を意味するのかを理解するようにしてください。

source: Minimal VM level events
ja_jp: 最小限の VM レベルのイベント

source: Minimal footprint Java applications optimized for running in containers
ja_jp: コンテナーでの実行に最適化されたミニマムフットプリントのJavaアプリケーション

source: Minimal or zero config to get service registration working
ja_jp: 最小限またはゼロ設定でサービス登録を動作可能

source: Minimum logging level sets a floor level that Quarkus will be needed to potentially generate, opening the door to optimization opportunities. As an example, in native execution the minimum level enables lower level checks (e.g. `isTraceEnabled`) to be folded to `false`, resulting in dead code elimination for code that will never to be executed.
ja_jp: 最小ロギングレベルは、Quarkusが潜在的に生成するために必要となるフロアレベルを設定し、最適化の機会の扉を開きます。例えば、ネイティブ実行では、最小レベルを設定することで、低レベルのチェック(例: `isTraceEnabled` )を `false` に折りたたむことができ、結果として、実行されることのないコードのデッドコードを排除することができます。

source: Minor version is the current timestamp at generation time.
ja_jp: マイナーバージョンは、生成時の現在のタイムスタンプになります。

source: Miscellaneous
ja_jp: その他

source: Miscellaneous improvements
ja_jp: その他の改善

source: Mismatches will not be detected, and may result in unpredictable behavior.
ja_jp: 不一致は検出されず、予期しない動作が発生する可能性があります。

source: Missing Properties
ja_jp: 不明なプロパティ

source: Missing warning on unknown application configuration property https://github.com/quarkusio/quarkus/issues/14889[#14889]
ja_jp: 不明なアプリケーション設定プロパティに対する警告の欠落 link:https://github.com/quarkusio/quarkus/issues/14889[#14889]

source: Mixin support
ja_jp: Mixinサポート

source: Mixing `@QuarkusTest` with other type of tests
ja_jp: `@QuarkusTest` と他のタイプのテストを混合

source: Mixing security tests
ja_jp: セキュリティーテストの混合

source: Mixing tests annotated with `@QuarkusTest` with tests annotated with either `@QuarkusDevModeTest`, `@QuarkusProdModeTest` or `@QuarkusUnitTest` is not allowed in a single execution run (in a single Maven Surefire Plugin execution, for instance), while the latter three can coexist.
ja_jp: `@QuarkusTest` でアノテーションが付けられたテストと、 `@QuarkusDevModeTest`、 `@QuarkusProdModeTest`、 `@QuarkusUnitTest` のいずれかでアノテーションが付けられたテストを、1 回の実行 (たとえば、1 回の Maven Surefire プラグインの実行) で混合することはできません。ただし、後者の 3 つは共存できます。

source: Mock Support
ja_jp: モックサポート

source: Mock support is also provided in a similar fashion by using the `@WithKubernetesTestServer` explained in the previous section:
ja_jp: 前節で説明した `@WithKubernetesTestServer` を使用することで、同様の方法でモック・サポートも提供されます：

source: Mock support is also provided in a similar fashion:
ja_jp: モックサポートも同様の方法で提供されています。

source: Mocking
ja_jp: モック

source: Mocking CDI Interceptors
ja_jp: CDI インターセプターのモック化

source: Mocking `EntityManager`, `Session` and entity instance methods
ja_jp: `EntityManager` 、 `Session` とエンティティインスタンスのメソッドのモック化

source: Mocking `Mutiny.Session` and entity instance methods
ja_jp: `Mutiny.Session` とエンティティインスタンスのメソッドのモック化

source: Mocking does not work when using `@NativeImageTest` or `@QuarkusIntegrationTest`.
ja_jp: `@NativeImageTest` または `@QuarkusIntegrationTest` を使用すると、モッキングは機能しません。

source: Mocking does not work when using `@QuarkusIntegrationTest`.
ja_jp: `@QuarkusIntegrationTest` を使用した場合、モッキングは動作しません。

source: Mocking on Startup
ja_jp: 起動時のモック

source: Mocking the client for tests
ja_jp: テストのためのクライアントのモッキング

source: Mocking using QuarkusMock
ja_jp: QuarkusMock を使用したモッキング

source: Mocking with InjectMock
ja_jp: InjectMock でモックする

source: Mocking with QuarkusMock
ja_jp: QuarkusMock でモックする

source: Mode: Access mode for memory region
ja_jp: Mode: メモリー領域のアクセスモード。

source: Model
ja_jp: モデル

source: Model classes need to be consistently added to a given persistence unit. That meant that all dependent model classes of a given entity (mapped super classes, embeddables...) are required to be attached to the persistence unit. As we are dealing with the persistence unit at the package level, it should be simple enough.
ja_jp: モデルクラスは与えられた永続化ユニットに一貫して追加される必要があります。 つまり、与えられたエンティティのすべての依存するモデルクラス（ `@MappedSuperClass` 、 `@Embeddable` ...）はすべて同じ永続化ユニットにアタッチされる必要があります。 パッケージレベルで永続化ユニットを扱っているので簡単なことでしょう。

source: Model the domain objects
ja_jp: ドメインオブジェクトのモデル化

source: Modern applications often need to run specific tasks periodically.
ja_jp: モダンなアプリケーションは、定期的に特定のタスクを実行する必要があることが多くあります。

source: Modern applications often need to run specific tasks periodically. In this guide, you learn how to schedule periodic clustered tasks using the http://www.quartz-scheduler.org/[Quartz] extension.
ja_jp: 最近のアプリケーションでは、定期的に特定のタスクを実行する必要があることがよくあります。このガイドでは、 link:http://www.quartz-scheduler.org/[Quartz] エクステンションを使用して定期的にクラスター化されたタスクをスケジュールする方法を学びます。

source: Modern applications often need to run specific tasks periodically. In this guide, you learn how to schedule periodic tasks.
ja_jp: 最近のアプリケーションでは、定期的に特定のタスクを実行する必要があります。このガイドでは、定期的なタスクをスケジュールする方法を学びます。

source: Modern applications often need to run specific tasks periodically. There are two scheduler extensions in Quarkus. The `quarkus-scheduler` extension brings the API and a lightweight in-memory scheduler implementation. The `quarkus-quartz` extension implements the API from the `quarkus-scheduler` extension and contains a scheduler implementation based on the Quartz library. You will only need `quarkus-quartz` for more advanced scheduling use cases, such as persistent tasks and clustering.
ja_jp: 最近のアプリケーションでは、特定のタスクを定期的に実行する必要があることがよくあります。Quarkusには、2つのスケジューラエクステンションがあります。 `quarkus-scheduler` エクステンションは、APIと軽量のインメモリスケジューラー実装を提供します。 `quarkus-quartz` エクステンションは、 `quarkus-scheduler` エクステンションのAPIを実装し、Quartzライブラリに基づくスケジューラ実装を含んでいます。 `quarkus-quartz` が必要になるのは、永続タスクやクラスタリングなど、より高度なスケジューリングのユースケースだけです。

source: Modern applications often need to run specific tasks periodically. There are two scheduler extensions in Quarkus. The `quarkus-scheduler` extension brings the API and a lightweight in-memory scheduler implementation. The `quarkus-quartz` extension implements the API from the `quarkus-scheduler` extension and contains a scheduler implementation based on the Quartz library. You will only need `quarkus-quartz` for more advanced scheduling use cases, such as persistent tasks, clustering and programmatic scheduling of jobs.
ja_jp: 最近のアプリケーションでは、定期的に特定のタスクを実行する必要があります。Quarkusには2つのスケジューラーエクステンションがあります。 `quarkus-scheduler` エクステンションには、APIと軽量なインメモリースケジューラーの実装が含まれています。 `quarkus-quartz` エクステンションは、 `quarkus-scheduler` エクステンションのAPIを実装し、Quartzライブラリをベースにしたスケジューラーの実装が含まれています。 `quarkus-quartz` が必要になるのは、永続的タスク、クラスターリング、ジョブのプログラマティックスケジューリングなど、より高度なスケジューリングのユースケースのみです。

source: Modes: - properties - js - java - xml - json - yaml - sql - html - css - sass - markdown
ja_jp: モード: - properties - js - java - xml - json - yaml - sql - html - css - sass - markdown

source: Modify the controller to secure the `hello` method
ja_jp: コントローラーを変更して、 `hello` メソッドを保護します。

source: Modifying `function.zip`
ja_jp: `function.zip` の修正

source: Modularity Benefits
ja_jp: モジュール化のメリット

source: Mongo and Panache did just what we needed nothing more
ja_jp: MongoとPanacheは、私たちが必要としていたものを提供してくれました。

source: Mongo with Panache offers active record support for both the imperative and reactive APIs.
ja_jp: Mongo with Panacheは、命令型APIとリアクティブ型APIの両方でアクティブレコードサポートを提供します。

source: MongoDB Client
ja_jp: MongoDBクライアント

source: MongoDB Dev Services is based on link:https://www.testcontainers.org/modules/databases/mongodb/[Testcontainers MongoDB module] that will start a single node replicaset.
ja_jp: MongoDB Dev Servicesは link:https://www.testcontainers.org/modules/databases/mongodb/[Testcontainers MongoDBモジュール] をベースにしており、単一ノードのレプリカセットを起動することができます。

source: MongoDB Liquibase extension
ja_jp: MongoDB Liquibase エクステンション

source: MongoDB REST Data with Panache extension (`quarkus-mongodb-rest-data-panache`)
ja_jp: MongoDB REST Data with Panache エクステンション ( `quarkus-mongodb-rest-data-panache` )

source: MongoDB allows you to configure multiple clients. Using several clients works the same way as having a single client.
ja_jp: MongoDBでは、複数のクライアントを設定することができます。複数のクライアントを使っても、単一のクライアントを持つのと同じように動作します。

source: MongoDB client
ja_jp: MongoDBクライアント

source: MongoDB installed or Docker installed
ja_jp: MongoDBがインストールされているか、Dockerがインストールされている

source: MongoDB is a well known NoSQL Database that is widely used, but using its raw API can be cumbersome as you need to express your entities and your queries as a MongoDB link:{mongodb-doc-root-url}/bson/documents/#document[`Document`].
ja_jp: MongoDBは広く利用されている有名なNoSQLデータベースですが、エンティティとクエリをMongoDB link:{mongodb-doc-root-url}/bson/documents/#document[`Document`] として表現する必要があるため、生のAPIを使用するのは面倒です。

source: MongoDB is a well known NoSQL Database that is widely used, but using its raw API can be cumbersome as you need to express your entities and your queries as a MongoDB link:{mongodb-doc-root-url}/fundamentals/data-formats/documents/#document[`Document`].
ja_jp: MongoDB は広範に使用されており、よく知られた NoSQL データベースですが、エンティティーとクエリーを MongoDB リンク ({mongodb-doc-root-url}/fundamentals/data-formats/documents/#document[`ドキュメント`]) として表現する必要があるため、生の API を使用するのは面倒です。

source: MongoDB is a well known NoSQL Database that is widely used.
ja_jp: MongoDBは広く使われているNoSQLデータベースとして知られています。

source: MongoDB is a well known NoSQL Database that is widely used. MongoDB with Panache offers a new layer atop this familiar framework. This guide will not dive in to the specifics of either as those are already covered in the xref:mongodb-panache.adoc[MongoDB with Panache guide]. In this guide, we'll cover the Kotlin specific changes needed to use MongoDB with Panache in your Kotlin-based Quarkus applications.
ja_jp: MongoDBは、広く利用されている有名なNoSQLデータベースです。MongoDB with Panacheは、このよく知られたフレームワークの上に新しいレイヤーを提供します。このガイドでは、MongoDB with Panache link:mongodb-panache.html[MongoDB with Panache] についてはすでに説明されているため詳細については説明しません。このガイドでは、KotlinベースのQuarkusアプリケーションでMongoDB with Panacheを使用するために必要なKotlin固有の変更点について説明します。

source: MongoDB offers ACID transactions since version 4.0.
ja_jp: MongoDBは、バージョン4.0からACIDトランザクションを提供しています。

source: MongoDB queries are JSON based, so you will need some String manipulation or using the `Document` type and it will need a lot of boilerplate code.
ja_jp: MongoDBのクエリはJSONベースなので、文字列の操作や `Document` 型を使う必要があり、多くのボイラープレートコードが必要になります。

source: MongoDB queries are JSON based, so you will need some String manipulation or using the `Document` type, and it will need a lot of boilerplate code.
ja_jp: MongoDB のクエリは JSON ベースなので、文字列の操作や `Document` 型を使う必要があり、多くのボイラープレートコードが必要になります。

source: MongoDB queries are super powerful, but overly verbose for common operations, requiring you to write queries even when you don't need all the parts.
ja_jp: MongoDBのクエリは非常に強力ですが、一般的な操作では冗長すぎて、すべてのパーツが必要ではない場合でもクエリを書かなければなりません。

source: MongoDB queries must be valid JSON documents, using the same field multiple times in a query is not allowed using PanacheQL as it would generate an invalid JSON (see link:https://github.com/quarkusio/quarkus/issues/12086[this issue on GitHub]).
ja_jp: MongoDBのクエリは、有効なJSONドキュメントでなければなりません。同じフィールドをクエリ内で複数回使用することは、無効なJSONを生成することになるため、PanacheQLでは許可されません ( link:https://github.com/quarkusio/quarkus/issues/12086[GitHub のこの問題]を参照)。

source: MongoDB queries must be valid JSON documents, using the same field multiple times in a query is not allowed using PanacheQL as it would generate an invalid JSON (see link:https://github.com/quarkusio/quarkus/issues/12086[this issue on github]).
ja_jp: MongoDBのクエリは、有効なJSONドキュメントでなければなりません。同じフィールドをクエリ内で複数回使用することは、無効なJSONを生成することになるため、PanacheQLでは許可されません ( link:https://github.com/quarkusio/quarkus/issues/12086[githubのこの問題]を参照)。

source: MongoDB service binding
ja_jp: MongoDBサービスバインディング

source: MongoDB with Panache
ja_jp: MongoDBをPanacheで使用する

source: MongoDB with Panache allows using reactive style implementation for both entities and repositories. For this, you need to use the Reactive variants when defining your entities : `ReactivePanacheMongoEntity` or `ReactivePanacheMongoEntityBase`, and when defining your repositories: `ReactivePanacheMongoRepository` or `ReactivePanacheMongoRepositoryBase`.
ja_jp: MongoDB with Panacheでは、エンティティとリポジトリの両方でリアクティブスタイルの実装を使うことができます。そのためには、エンティティを定義するときには `ReactivePanacheMongoEntity` または `ReactivePanacheMongoEntityBase` を、リポジトリを定義するときには `ReactivePanacheMongoRepository` または `ReactivePanacheMongoRepositoryBase` を、それぞれ Reactive バリアントとして使用する必要があります。

source: MongoDB with Panache also supports extended MongoDB queries by providing a `Document` query, this is supported by the find/list/stream/count/delete methods.
ja_jp: MongoDB with Panacheは、 `Document` クエリを提供することでMongoDBの拡張クエリもサポートしています。これはfind/list/stream/count/deleteメソッドでサポートされています。

source: MongoDB with Panache also supports extended MongoDB queries by providing a `Document` query, this is supported by the find/list/stream/count/delete/update methods.
ja_jp: MongoDB with Panacheは、 `Document` クエリを提供することでMongoDBの拡張クエリもサポートしています。これはfind/list/stream/count/deleteメソッドでサポートされています。

source: MongoDB with Panache and Kotlin
ja_jp: MongoDB with PanacheとKotlin

source: MongoDB with Panache currently supports the database per tenant approach, it's similar to schema per tenant approach when compared to SQL databases.
ja_jp: MongoDB with Panache は現在、テナントごとのデータベースアプローチをサポートしています。これは、SQL データベースと比較すると、テナントごとのスキーマアプローチに似ています。

source: MongoDB with Panache now comes with transaction support.
ja_jp: MongoDB with Panacheは、トランザクションをサポートするようになりました。

source: MongoDB with Panache offers operations to update multiple documents based on an update document and a query : `Person.update("foo = ?1 and bar = ?2", fooName, barName).where("name = ?1", name)`.
ja_jp: MongoDB with Panache はアップデートドキュメントおよびクエリーに基づいて複数のドキュメントを更新する操作を提供します: `Person.update("foo = ?1 and bar = ?2", fooName, barName).where("name = ?1", name)`

source: MongoDB with Panache offers operations to update multiple documents based on an update document and a query : `Person.update("foo = ?1, bar = ?2", fooName, barName).where("name = ?1", name)`.
ja_jp: MongoDB with Panache は、更新ドキュメントとクエリに基づいて複数のドキュメントを更新する操作を提供します: `Person.update("foo = ?1, bar = ?2", fooName, barName).where("name = ?1", name)` .

source: MongoDB with Panache provides active record style entities (and repositories) like you have in xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] and focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: MongoDB with Panacheは、 link:hibernate-orm-panache.html[Hibernate ORM with Panache]にあるようなアクティブレコードスタイルのエンティティ（およびリポジトリ）を提供し、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: MongoDB with Panache relies on compile-time bytecode enhancements to your entities.
ja_jp: MongoDB with Panacheは、エンティティに対してコンパイル時にバイトコードを強化します。

source: MongoDB with Panache relies on compile-time bytecode enhancements to your entities. If you define your entities in the same project where you build your Quarkus application, everything will work fine.
ja_jp: MongoDB with Panache は、コンパイル時のバイトコードエクステンションによってエンティティーを拡張します。 Quarkus アプリケーションをビルドするのと同じプロジェクトであれば、すべて正常に動作します。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos/[PojoCodecProvider] to convert your entities to a MongoDB `Document`.
ja_jp: MongoDB with Panacheでは、 link:{mongodb-doc-root-url}/bson/pojos/[PojoCodecProvider]を使ってエンティティをMongoDB `Document` に変換します。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider], a MongoDB codec which mandates the presence of a parameterless constructor.
ja_jp: MongoDB with Panache は link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider] を使います。これは MongoDB のコーデックで、パラメータなしのコンストラクタの存在を義務付けています。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider], with link:{mongodb-doc-root-url}/pojos/#pojo-support[automatic POJO support], to automatically convert your object to a BSON document.
ja_jp: MongoDB with Panacheは、link:{mongodb-doc-root-url}/pojos/#pojo-support[automatic POJO support]の link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider]を使用して、オブジェクトをBSONドキュメントに自動変換します。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider] to convert your entities to a MongoDB `Document`.
ja_jp: MongoDB with Panacheでは、link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider] を使用してエンティティーを MongoDB `Document` に変換します。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider], with link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/#configure-the-driver-for-pojos[automatic POJO support], to automatically convert your object to a BSON document.
ja_jp: MongoDB with Panache は link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider] と link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/#configure-the-driver-for-pojos[automatic POJO support] で、オブジェクトから BSON ドキュメントに自動変換しています。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider], with link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/#configure-the-driver-for-pojos[automatic POJO support], to automatically convert your object to a BSON document. This codec also supports Java records so you can use them for your entities or an attribute of your entities.
ja_jp: MongoDB with Panache は、link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/#configure-the-driver-for-pojos[自動 POJO サポート] のある {mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo/[PojoCodecProvider] を使用して、 オブジェクトを BSON ドキュメントに自動的に変換します。 このコーデックは Java レコードもサポートしているため、エンティティーまたはエンティティーの属性に使用できます。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo[PojoCodecProvider] to convert your entities to a MongoDB `Document`.
ja_jp: MongoDB with Panacheでは、link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo[PojoCodecProvider] を使用してエンティティーを MongoDB `Document` に変換します。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo[PojoCodecProvider], a MongoDB codec which mandates the presence of a parameterless constructor.
ja_jp: MongoDB with Panache は link:{mongodb-doc-root-url}/fundamentals/data-formats/document-data-format-pojo[PojoCodecProvider] を使用します。つまり、MongoDB のコーデックで、パラメーターなしのコンストラクターが必要となります。

source: Monitor and log outgoing traffic
ja_jp: 発信トラフィックを監視およびログに記録する

source: Monitor service health
ja_jp: サービスのヘルスを監視する

source: Monitoring Business Method Invocations and Events
ja_jp: ビジネスメソッドの呼び出しとイベントの監視

source: Monitoring Option
ja_jp: 監視オプション

source: Monitoring Quarkus JVM Mode With Cryostat
ja_jp: CryostatでQuarkusのJVMモードを監視

source: Monitoring Quarkus apps using Micrometer and Prometheus into OpenShift
ja_jp: MicrometerとPrometheusでOpenShiftにおけるQuarkusアプリのモニタリング

source: Monitoring options such as JDK flight recorder, jvmstat, heap dumps, NMT (starting with Mandrel 24.1 for JDK 23), and remote JMX can be added to the native executable build. Simply supply a comma separated list of the monitoring options you wish to include at build time.
ja_jp: JDK Flight Recorder、jvmstat、ヒープダンプ、NMT (JDK 23 の Mandrel 24.1 以降)、リモート JMX などの監視オプションをネイティブ実行可能ビルドに追加できます。 ビルド時に追加するには、監視オプションのコンマ区切りリストを提供します。

source: Monitors and controls continuous testing. View test results, rerun tests, or toggle testing state.
ja_jp: 継続的テストを監視および制御します。テスト結果の表示、テストの再実行、テスト状態の切り替えが可能です。

source: Monopolization cases
ja_jp: 独占の場合

source: More About Configuring Protected Resources
ja_jp: 保護されたリソースの設定についての詳細

source: More Information
ja_jp: 詳細

source: More Parameter Declarations Examples
ja_jp: その他のパラメーター宣言の例

source: More Reactive Changes
ja_jp: 更なるリアクティブの変更

source: More Spring guides
ja_jp: その他のSpringガイド

source: More WebSocket Information
ja_jp: その他のWebSocket情報

source: More about configuring protected resources
ja_jp: 保護されたリソースの設定に関する詳細

source: More about security features in Quarkus
ja_jp: Quarkusのセキュリティ機能についての詳細

source: More advanced scenarios benefit from "Program-of-Thought," which involves multiple chained prompts, where the output of one step feeds into the next, often including optional verification steps for enhanced accuracy.
ja_jp: より高度なシナリオでは、「Program-of-Thought」の恩恵を受けます。これは、複数の連結されたプロンプトを含み、あるステップの出力が次のステップに供給され、多くの場合、精度を高めるためのオプションの検証ステップが含まれます。

source: More advanced usage
ja_jp: より高度な使用法

source: More broadly, we would like to thank everyone contributing to Project Leyden.
ja_jp: より広く、Project Leyden に貢献しているすべての方々に感謝いたします。

source: More complex code
ja_jp: より複雑なコード

source: More configuration
ja_jp: その他設定

source: More content about this is coming soon...
ja_jp: これに関するさらなるコンテンツは近日公開予定です。
